Repository: sjentsch/jamoviDocs
Catalog: _locale/*/LC_MESSAGES/_pages/jg_11_descriptive-analyses.po
Languages: de, es

source: Descriptive analyses
de: Deskriptivstatistische Analysen
es: Análisis descriptivo

source: How to perform descriptive analyses and create graphs in jamovi:
de: Sie können mit jamovi auf die folgende Weise deskriptivstatistische Analysen durchführen und Diagramme erstellen:
es: Cómo realizar análisis descriptivo y crear gráficos en jamovi:

source: Select ``Analyses`` → ``Exploration`` → ``Descriptives``.
de: Wählen Sie ``Analyses`` → ``Exploration`` → ``Descriptives``.
es: Selecciona ``Analyses`` → ``Exploration`` → ``Descriptives``.

source: Drag and drop the variables you want descriptive analyses for to ``Variables``.
de: Ziehen Sie die Variablen, für die Sie deskriptive Analysen durchführen wollen, per Drag & Drop oder mit den Pfeil-Buttons auf ``Variables``.
es: Arrastre y suelte las variables para las que desea realizar análisis descriptivos a ``Variables``.

source: The result is shown in the right panel. Right-click on the output to save or copy it.
de: Das Ergebnis wird im rechten Panel angezeigt. Klicken Sie mit der rechten Maustaste auf die Ausgabe (oder Teile der Ausgabe), um sie zu speichern oder zu kopieren.
es: El resultado se ve en el panel derecho. Haga click-derecho en la salida para guardarlo o copiarlo.

source: To split your descriptive analyses on a categorical variable (e.g. to separate by gender), move that variable to ``Split by``.
de: Um Ihre deskriptivstatistischen Analysen separat für die verschiedenen Stufen eine kategorialen Variable durchzuführen (z. B. um nach Geschlechtern zu trennen), verschieben Sie diese Variable (per drag-and-drop oder mit den Pfeil-Buttons) in das Feld ``Split by``.
es: Para dividir sus análisis descriptivos en una variable categórica (por ejemplo, para separar por género), mueva esa variable a ``Split by``.

source: This changes how the output looks like:
de: Dadurch ändert sich das Aussehen der Ausgabe:
es: Esto cambia el aspecto de la salida:

source: Click the ``Statistics`` tab to see more alternatives.
de: Klicken Sie auf das Drop-down-Menü ``Statistics``, um weitere Auswahlmöglichkeiten zu sehen.
es: Presione la pestaña ``Statistics`` para ver más alternativas.

source: To create a plot based on the above choices, click the ``Plots`` tab and tick the box of your desired plot. If you would like to identify outliers and to check whehter your variables conform with a normal distribution, then you should tick ``Box plot``, ``Violin``, and ``Q-Q``.
de: Um ein Diagramm basierend auf den obigen Auswahlmöglichkeiten zu erstellen, öffnen Sie das Drop-down-Menü ``Plots`` und kreuzen das Kästchen der gewünschten Diagramme an. Wenn Sie Ausreißer identifizieren oder überprüfen möchten, ob Ihre Variablen einer Normalverteilung entsprechen, dann sollten Sie ``Box plot``, ``Violin`` und ``Q-Q`` ankreuzen.
es: Para crear un gráfico basado en las opciones anteriores, haga clic en la pestaña ``Plots`` y marque la casilla del gráfico deseado. Si desea identificar los valores atípicos y comprobar si sus variables se ajustan a una distribución normal, deberá marcar las casillas ``Box plot``, ``Violin`` y ``Q-Q``.

source: Further help from the community resources
de: Mehr Hilfe in den Community-Ressourcen
es: Más ayuda en los recursos comunitarios

source: If you would like to have these concepts explained in a different way, please have a look at this `introductory video <https://www.youtube.com/embed/srqNCux0ijY?list=PLkk92zzyru5OAtc_ItUubaSSq6S_TGfRn>`__ by `Barton Poulson <https://datalab.cc/jamovi>`__.
de: Wenn Sie diese Analysen und die zugrundeliegenden Konzepte auf eine andere Art und Weise erklärt bekommen möchten, können Sie sich das folgende `Einführungsvideo <https://www.youtube.com/embed/srqNCux0ijY?list=PLkk92zzyru5OAtc_ItUubaSSq6S_TGfRn>`__ von `Barton Poulson <https://datalab.cc/jamovi>`__ ansehen.
es: Si quiere que le expliquen estos conceptos de otra manera, vea este `vídeo introductorio <https://www.youtube.com/embed/srqNCux0ijY?list=PLkk92zzyru5OAtc_ItUubaSSq6S_TGfRn>`__ de `Barton Poulson <https://datalab.cc/jamovi>`__.

source: For those, aiming to stretch even further to an in-depth introduction, you can read the respective chapter in the “Learning statistics with jamovi” `web documentation <https://lsj.readthedocs.io/en/latest/lsj/Ch04_Descriptives.html>`__ or chapter 4 of the `e-book <https://www.learnstatswithjamovi.com/>`__ by `Danielle J. Navarro <https://djnavarro.net/>`__ and `David R. Foxcroft <https://www.davidfoxcroft.com/>`__.
de: Wer noch weiter in die Tiefe gehen möchte, kann den entsprechenden Abschnitt in der `Webdokumentation "Learning statistics with jamovi" <https://lsj.readthedocs.io/en/latest/lsj/Ch04_Descriptives.html>`__ oder Kapitel 4 des `e-Books <https://www.learnstatswithjamovi.com/>`__ von `Danielle J. Navarro <https://djnavarro.net/>`__ und `David R. Foxcroft <https://www.davidfoxcroft.com/>`__ lesen.
es: Para aquellos que quieran profundizar aún más en la introducción, pueden leer el capítulo correspondiente de la `documentación web "Learning statistics with jamovi" <https://lsj.readthedocs.io/en/latest/lsj/Ch04_Descriptives.html>`__ o el capítulo 4 del `e-book <https://www.learnstatswithjamovi.com/>`__ de `Danielle J. Navarro <https://djnavarro.net/>`__ y `David R. Foxcroft <https://www.davidfoxcroft.com/>`__.
