Repository: sjentsch/jamoviDocs
Catalog: _locale/*/LC_MESSAGES/_pages/jg_18_Filtering_data.po
Languages: de

source: How do I create a filter variable and use it for selection?
de: Wie erstelle ich eine Filtervariable und verwende sie zur Auswahl von Fällen?

source: open the ``Data`` tab and select ``Filter`` (either by using the symbol in the icon bar or the one in the bottom-left corner of the jamovi window)
de: Öffnen Sie die Registerkarte ``Data`` und wählen Sie ``Filter`` (entweder über das Symbol in der Symbolleiste oder über das Symbol in der unteren linken Ecke des jamovi-Fensters)

source: in order to access functions, press the ``fx`` icon in the filter settings
de: um auf die Funktionen zur Berechnung zuzugreifen, drücken Sie das Symbol ``fx`` in den Filtereinstellungen

source: there also is a switch where you can activate or deactivate the filter (see the comment in red below)
de: es gibt auch einen Schalter, mit dem Sie den Filter aktivieren oder deaktivieren können (siehe den Kommentar in Rot weiter unten)

source: you close the filter settings by pressing the arrow in the top-right corner
de: Sie schließen die Filtereinstellungen, indem Sie auf den Pfeil in der rechten oberen Ecke drücken

source: there are three large approaches, to exclude outliers:
de: gibt es drei generelle Ansätze, um Ausreißer auszuschließen:

source: based upon z-scores (the absolute value should be larger 3.3; this equals to a probability of 0.1% = 1 / 1000)
de: basierend auf z-Scores (wenn der absolute Wert größer ist als 3,3; dies entspricht einer Wahrscheinlichkeit von 0,1% = 1 / 1000)

source: based upon the IQR (like in a box plot)
de: basierend auf dem IQR (wie in einem Boxplot)

source: based on the Mahalanobis distance (multivariate)
de: basierend auf der Mahalanobis-Distanz (multivariat)

source: for 1., there exists a function in jamovi (see next bullet point), for 2. and 3. you have to use R-code (decribed two bullet point below); for 2. you could also do it visually (three bullet points below)
de: für 1. und 2. gibt es Funktionen in jamovi (siehe nächster Aufzählungspunkt), für 3. müssen Sie R-Code verwenden (zwei Aufzählungspunkte weiter unten beschrieben); für 2. könnten Sie Fälle auch visuell (mit Box-Whisker-Plots) ausschließen (drei Aufzählungspunkte weiter unten)

source: you can either use an function-based selection (e.g., based on z-scores):
de: Sie können entweder eine Auswahl verwenden, die auf einer Berechnung beruht (z. B. basierend auf z-Scores oder IQR-Werten):

source: you can create a select variable (how to do that is `described below <#how-to-manually-create-a-variable-for-selecting-deselecting-cases>`__), use R-scripts to find outliers and mark those outliers in the variable you created:
de: Sie können eine Auswahlvariable erstellen (wie das geht, ist `weiter unten <#how-to-manually-create-a-variable-for-selecting-deselecting-cases>`__ beschrieben) und R-Skripte verwenden, um Ausreißer zu finden und diese Ausreißer in der von Ihnen erstellten Variablen zu markieren:

source: the first code example does this based upon the interquartile range (doing the same with code that you visually do with box plots; remember to adjust the variable names in VL)
de: das erste Code-Beispiel tut dies auf der Basis des Interquartilsbereichs (Sie tun mit dem Code dasselbe, was Sie visuell mit Boxplots tun; denken Sie daran, die Variablennamen in der Variablenliste ``VL`` anzupassen)

source: the second code example detects multivariate outliers based upon the Mahalanobis distance (remember to adjust the variable names in VL)
de: das zweite Codebeispiel detektiert multivariate Ausreißer auf der Basis der Mahalanobis-Distanz (denken Sie auch hier daran, die Variablennamen in ``VL`` anzupassen)

source: the output from those scripts tells you which lines you should de-select
de: die Ausgabe dieser Skripte sagt Ihnen, welche Zeilen / Datenpunkte Sie abwählen / aus Ihren Analysen entfernen sollten

source: you use the scripts within the `Rj editor <jamovi-module_Rj>`__, just copy-and-paste them and run them by hitting the ►-button (the little green triangle)
de: Sie verwenden die Skripte im `Rj-Editor <jamovi-module_Rj>`__, indem Sie den Code einfach kopieren und einfügen und ihn dann mit der ►-Taste (das kleine grüne Dreieck) ausführen.

source: :red:`PLEASE NOTE: If you already filtered cases, the lines with filtered cases are not included and the line numbers when using the R-scripts get wrong. Open the filter settings by either double-clicking on the header line of the filter variable or use the funnel-symbol in the bottom-left corner of the jamovi window (note that you can only see it, if you selected the tab “Data”) and deactivate the filter.`
de: :red:`BITTE BEACHTEN SIE: Wenn Sie bereits Fälle gefiltert haben, werden die Zeilen mit gefilterten Fällen nicht berücksichtigt und die Zeilennummern bei Verwendung der R-Skripte werden falsch. Öffnen Sie die Filtereinstellungen, indem Sie entweder auf die Kopfzeile der Filtervariablen doppelklicken oder das Trichtersymbol in der linken unteren Ecke des jamovi-Fensters verwenden (beachten Sie, dass Sie es nur sehen können, wenn Sie den Reiter "Daten" ausgewählt haben) und den Filter deaktivieren.`

source: the filter conditions can be combined using boolean ``and`` / ``or``:
de: die Filterbedingungen lassen sich mit booleschen ``and`` / ``or`` kombinieren:

source: you can also de-select cases by setting limits to the values of variables (after visually checking the box-plots under ``Descriptives``):
de: Sie können auch Fälle manuell abwählen, indem Sie Grenzen für die Werte von Variablen setzen (nach visueller Kontrolle der Box-Whisker-Plots unter ``Descriptives``):

source: How to manually create a variable for selecting / deselecting cases?
de: Wie kann man manuell eine Variable zur Auswahl / Abwahl von Fällen erstellen?

source: open the ``Data`` tab so that you see your data spreadsheet
de: Öffnen Sie die Registerkarte ``Data``, so dass Sie Ihre Datentabelle sehen.

source: go to the first column (if there are filter variables, to the first column after those)
de: Gehen Sie zur ersten Spalte (wenn Filtervariablen existieren, zur ersten Spalte nach diesen Filtervariablen)

source: right-click on the header line in that column, choose ``Add variable`` in the menu that opens, and then ``Data Variable`` → ``Insert``
de: Klicken Sie mit der rechten Maustaste auf die Kopfzeile in dieser Spalte, wählen Sie im sich öffnenden Menü ``Add variable`` und dann ``Data variable`` → ``Insert``.

source: briefly check how many participants are contained in your file by going to the last line of your data set, remember this line number
de: Prüfen Sie kurz, wie viele Teilnehmer in Ihrer Datei enthalten sind, indem Sie zur letzten Zeile Ihres Datensatzes gehen. Merken Sie sich diese Zeilennummer.

source: now, we have to to a little bit of magic in Excel, LibreOffice Calc or `Google Sheets <https://docs.google.com/spreadsheets>`__: open one of these programs, write ``1`` in the first and the second line of an empty spreadsheet, mark these two lines and then use the little black marker bottom right to drag the ones until you reached the number of participants in your data set within jamovi
de: Nun müssen Sie ein wenig in Excel, LibreOffice Calc oder `Google Sheets <https://docs.google.com/spreadsheets>`__ „zaubern“: Öffnen Sie eines dieser Programme, schreiben Sie ``1`` in die erste und zweite Zeile eines leeren Tabellenblatts, markieren Sie diese beiden Zeilen und ziehen Sie dann mit dem kleinen schwarzen Marker unten rechts die Einsen, bis Sie die Anzahl der Teilnehmer in Ihrem Datensatz in jamovi erreicht haben.

source: copy the column with the ``1`` you just created to jamovi and paste it into the variable you just created
de: Kopieren Sie die Spalte mit der ``1``, die Sie gerade erstellt haben, und fügen Sie diese in jamovi in die Spalte der Variablen ein, die Sie gerade erstellt haben.

source: open the filter settings (either by using the symbol in the icon bar or the funnel-icon in the bottom-left corner of the jamovi window) and either change an existing filter with adding:
de: Öffnen Sie die Filtereinstellungen (entweder über das Symbol in der Symbolleiste oder über das Trichter-Symbol in der linken unteren Ecke des jamovi-Fensters) und ändern Sie entweder einen bestehenden Filter durch Hinzufügen:

source: or create a new filter with just writing:
de: oder erstellen Sie einen neuen Filter indem Sie schreiben:

source: obviously you have to adjust ``[VARIABLE NAME]`` to the name of your selected variable
de: Natürlich müssen Sie ``[VARIABLE NAME]`` mit dem Namen der von Ihren ausgewählten Variablen ersetzen.

source: now you can de-select case by changing them ``1`` to ``0`` (and also select them again by changing ``0`` into ``1``)
de: Sie können nun die Auswahl der Fälle verändern: Ändern sie einen Fall von ``1`` auf ``0`` wird er ausgeschlossen (oder wieder eingeschlossen, indem Sie ``0`` in ``1`` ändern).
