Repository: sjentsch/jamoviDocs
Catalog: _locale/*/LC_MESSAGES/_pages/jg_23_t-test-onesample.po
Languages: de

source: t-test: One sample
de: t-Test für eine Stichprobe (One sample t-Test)

source: How to perform a one-sample t-test in jamovi:
de: Wie man einen t-Test für eine Stichprobe in jamovi durchführt:

source: A correct setup should look similar to this:
de: Die Einstellungen, um diese Analyse durchzuführen, sollten ungefähr so aussehen:

source: Select ``Analyses`` → ``T-Tests`` → ``One Sample T-Test``.
de: Wählen Sie ``Analyses`` → ``T-Tests`` → ``One Sample T-Test``.

source: Drag and drop your dependent variable to ``Dependent Variables``.
de: Ziehen Sie Ihre abhängige Variable per Drag & Drop oder mit dem Pfeil-Button auf ``Dependent Variables``.

source: Locate the section ``Hypothesis`` further down, this is where you enter the mean you want to test against.
de: Suchen Sie den Abschnitt ``Hypothesis`` weiter unten im Eingabe- / Options-Panel und geben Sie hier den Mittelwert ein, gegen den Sie testen wollen.

source: The result is shown in the right panel.
de: Das Ergebnis wird im rechten Panel angezeigt:

source: Further help from the community resources
de: Mehr Hilfe in den Community-Ressourcen

source: This `video <https://www.youtube.com/embed/DrBT4ezYIL8?list=PLkk92zzyru5OAtc_ItUubaSSq6S_TGfRn>`__ by `Barton Poulson <https://datalab.cc/jamovi>`__ provides a more comprehensive introduction into this test.
de: Das folgende `Video <https://www.youtube.com/embed/DrBT4ezYIL8?list=PLkk92zzyru5OAtc_ItUubaSSq6S_TGfRn>`__ von `Barton Poulson <https://datalab.cc/jamovi>`__ (in Englisch) bietet eine ausführlichere Einführung in diesen Test.

source: For those, aiming to stretch even further to an in-depth introduction, you can read the respective section in the “Learning statistics with jamovi” `web documentation <https://lsj.readthedocs.io/en/latest/lsj/Ch11_tTest_02.html>`__ or chapter 11.2 of the `e-book <https://www.learnstatswithjamovi.com/>`__ by `Danielle J. Navarro <https://djnavarro.net/>`__ and `David R. Foxcroft <https://www.davidfoxcroft.com/>`__.
de: Wer noch weiter in die Tiefe gehen möchte, kann den entsprechenden Abschnitt in der `Webdokumentation "Learning statistics with jamovi" <https://lsj.readthedocs.io/en/latest/lsj/Ch11_tTest_02.html>`__ oder Kapitel 11.2 des `e-book <https://www.learnstatswithjamovi.com/>`__ von `Danielle J. Navarro <https://djnavarro.net/>`__ und `David R. Foxcroft <https://www.davidfoxcroft.com/>`__ lesen.
