Repository: sjentsch/jamoviDocs
Catalog: _locale/*/LC_MESSAGES/_pages/jg_22_t-test-paired.po
Languages: de

source: t-test: Paired samples
de: t-Test für abhängige Stichproben

source: How to perform a paired samples t-test in jamovi:
de: Sie können einen t-Test für abhängige Stichproben in jamovi auf die folgende Weise durchführen:

source: You need two continuous variables. Make sure that the `measurement levels are set correctly <um_2_first-steps.html#data-variables>`_ so that both the continuous variables are marked as |continuous|.
de: Sie benötigen zwei kontinuierliche Variablen. Achten Sie darauf, dass die `Skalenniveaus korrekt gesetzt sind <um_2_erste-schritte.html#Daten-Variablen>`, und dass die beiden kontinuierlichen Variablen als |continuous| gekennzeichnet sind.

source: A correct setup should look similar to this:
de: Die Einstellungen, um diese Analyse durchzuführen, sollten ungefähr so aussehen:

source: Select ``Analyses`` → ``T-Tests`` → ``Paired Samples T-Test``.
de: Wählen Sie ``Analyses`` → ``T-Tests`` → ``Paired Samples T-Test``.

source: Drag and drop your two outcome variables to ``Paired Variables`` (select both variables in a pair at the same time - you do this by holding down the Ctrl key while clicking with the mouse on the variable you want to select).
de: Ziehen Sie Ihre beiden Ergebnisvariablen per Drag & Drop oder mit den Pfeil-Buttons auf ``Paired Variables`` (wählen Sie beide Variablen eines Paares gleichzeitig aus – Sie tun dies, indem Sie die Strg-Taste gedrückt halten, während Sie mit der Maus nacheinander auf beide Variablen klicken, die Sie auswählen möchten).

source: The result is shown in the right panel.
de: Das Ergebnis wird im rechten Panel angezeigt:

source: Further help from the community resources
de: Mehr Hilfe in den Community-Ressourcen

source: This `video <https://www.youtube.com/embed/lSjfYYiJG6E?list=PLkk92zzyru5OAtc_ItUubaSSq6S_TGfRn>`__ by `Barton Poulson <https://datalab.cc/jamovi>`__ provides a more comprehensive introduction into this test.
de: Das folgende `Video <https://www.youtube.com/embed/SM-DN9dpPd4?list=PLkk92zzyru5OAtc_ItUubaSSq6S_TGfRn>`__ von `Barton Poulson <https://datalab.cc/jamovi>`__ (in Englisch) bietet eine ausführlichere Einführung in diesen Test.

source: For those, aiming to stretch even further to an in-depth introduction, you can read the respective section in the “Learning statistics with jamovi” `web documentation <https://lsj.readthedocs.io/en/latest/lsj/Ch11_tTest_05.html>`__ or chapter 11.5 of the `e-book <https://www.learnstatswithjamovi.com/>`__ by `Danielle J. Navarro <https://djnavarro.net/>`__ and `David R. Foxcroft <https://www.davidfoxcroft.com/>`__.
de: Wer noch weiter in die Tiefe gehen möchte, kann den entsprechenden Abschnitt in der `Webdokumentation „Learning statistics with jamovi“ <https://lsj.readthedocs.io/en/latest/lsj/Ch11_tTest_05.html>`__ oder Kapitel 11.5 des `e-Books <https://www.learnstatswithjamovi.com/>`__ von `Danielle J. Navarro <https://djnavarro.net/>`__ und `David R. Foxcroft <https://www.davidfoxcroft.com/>`__ lesen.
