Repository: sjentsch/jamoviDocs
Catalog: _locale/*/LC_MESSAGES/_pages/jg_33_anova-rm.po
Languages: de

source: ANOVA: Repeated Measures
de: ANOVA mit Messwiederholung

source: How to perform a repeated measures ANOVA in jamovi:
de: So führen Sie eine ANOVA für wiederholte Messungen in jamovi durch:

source: A correct setup should look similar to this:
de: Die Einstellungen, um diese Analyse durchzuführen, sollten ungefähr so aussehen:

source: Select ``Analyses`` → ``ANOVA`` → ``Repeated Measures ANOVA``.
de: Wählen Sie ``Analyses`` → ``ANOVA`` → ``Repeated Measures ANOVA``.

source: In the box ``Repeated Measures Factors``: write the name of your outcome variable (e.g. ``My_scale``) and name the levels for each measurement occasion (e.g. ``Pre``, ``Post`` and ``12 month follow-up``). The images below shows the box with default values (left) and when the values has been set (right).
de: Schreiben Sie den Namen Ihrer Ergebnisvariable (z.B. ``Meine_Skala``) in das Feld ``Repeated Measures Factors`` und benennen Sie die Stufen für jeden Messzeitpunkt (z.B. ``Pre``, ``Post`` und ``12 month follow-up``). Die Bilder unten zeigen das Feld mit Standardwerten (links) und nachdem der Name der Skala und die Variablen zugewiesen wurden (rechts).

source: Drag and drop your outcome variables to their respective cells in ``Repeated Measures Cells``.
de: Weisen Sie Ihre Ergebnisvariablen per Drag & Drop oder mit den Pfeil-Buttons den entsprechenden Zellen in ``Repeated Measures Cells`` zu.

source: The results are shown in the right panel:
de: Das Ergebnis wird im rechten Panel angezeigt:

source: Further help from the community resources
de: Mehr Hilfe in den Community-Ressourcen

source: A more comprehensive introduction into this statistical method is provided by this `video <https://www.youtube.com/embed/m5JNwPgiMso?list=PLkk92zzyru5OAtc_ItUubaSSq6S_TGfRn>`__ by `Barton Poulson <https://datalab.cc/jamovi>`__.
de: Eine umfassendere Einführung in diese statistische Methode bietet das folgende `Video <https://www.youtube.com/embed/m5JNwPgiMso?list=PLkk92zzyru5OAtc_ItUubaSSq6S_TGfRn>`__ von `Barton Poulson <https://datalab.cc/jamovi>`__.

source: For those, aiming to stretch even further to an in-depth introduction, you can read the respective section in the “Learning statistics with jamovi” `web documentation <https://lsj.readthedocs.io/en/latest/lsj/Ch13_ANOVA_07.html>`__ or chapter 13.7 of the `e-book <https://www.learnstatswithjamovi.com/>`__ by Danielle J. Navarro and David R. Foxcroft.
de: Wer noch weiter in die Tiefe gehen möchte, kann den entsprechenden Abschnitt in der `Webdokumentation „Learning statistics with jamovi“ <https://lsj.readthedocs.io/en/latest/lsj/Ch13_ANOVA_07.html>`__ oder Kapitel 13.7 des `e-Books <https://www.learnstatswithjamovi.com/>`__ von `Danielle J. Navarro <https://djnavarro.net/>`__ und `David R. Foxcroft <https://www.davidfoxcroft.com/>`__ lesen.
