Repository: sjentsch/jamoviDocs
Catalog: _locale/*/LC_MESSAGES/_pages/jg_34_anova-mixed.po
Languages: de

source: ANOVA: Mixed
de: Varianzanalyse mit gemischtem Design (mit Messwiederholungs- und Zwischensubjekt-Faktoren)

source: How to perform a mixed ANOVA in jamovi:
de: So führen Sie eine Varianzanalyse mit gemischtem Design in jamovi durch:

source: You need at least one grouping variable with at least two levels (e.g. treatment / control) and one continuous outcome variable for each measurement time point. Make sure that the `measurement levels are set correctly <um_2_first-steps.html#data-variables>`_ so that all the variables for the repeated measurements are marked as |continuous| and the grouping variable(s) are marked as |nominal|.
de: Sie benötigen mindestens eine Gruppierungsvariable mit mindestens zwei Ebenen (z. B. Behandlung / Kontrolle) und eine kontinuierliche Ergebnisvariable für jeden Messzeitpunkt. Stellen Sie sicher, dass die `Skalenniveaus korrekt gesetzt sind <um_2_first-steps.html#data-variables>`_, so dass alle Variablen für die wiederholten Messungen als |continuous| und die Gruppierungsvariable(n) als |nominal| markiert sind.

source: A correct setup should look similar to this:
de: Die Einstellungen, um diese Analyse durchzuführen, sollten ungefähr so aussehen:

source: Select ``Analyses`` → ``ANOVA`` → ``Repeated Measures ANOVA``.
de: Wählen Sie ``Analyses`` → ``ANOVA`` → ``Repeated Measures ANOVA``.

source: In the box ``Repeated Measures Factors``: write the name of your outcome variable (e.g. ``My_scale``) and name the levels for each measurement occasion (e.g. ``Pre``, ``Post`` and ``12 month follow-up``). The images below illustrates this.
de: Schreiben Sie den Namen Ihrer Ergebnisvariable (z.B. ``Meine_Skala``) in das Feld ``Repeated Measures Factors`` und benennen Sie die Stufen für jeden Messzeitpunkt (z.B. ``Pre``, ``Post`` und ``12 month follow-up``). Die Bilder unten zeigen das Feld mit Standardwerten (links) und nachdem der Name der Skala und die Variablen zugewiesen wurden (rechts).

source: Drag and drop your outcome variables to their respective cells in ``Repeated Measures Cells``.
de: Weisen Sie Ihre Ergebnisvariablen per Drag & Drop oder mit den Pfeil-Buttons den entsprechenden Zellen in ``Repeated Measures Cells`` zu.

source: Move your grouping variable(s) to ``Between Subject Factors``.
de: Weisen Sie Ihre Gruppierungsvariable(n) per Drag & Drop oder mit den Pfeil-Buttons ``Between Subject Factors`` zu.

source: The result is shown in the right panel:
de: Das Ergebnis wird im rechten Panel angezeigt:

source: A little more comprehensive introduction into this statistical method is provided by this `video <https://www.youtube.com/embed/m5JNwPgiMso?list=PLkk92zzyru5OAtc_ItUubaSSq6S_TGfRn>`__.
de: Eine etwas umfassendere Einführung in diese statistische Methode bietet dieses `Video <https://www.youtube.com/embed/m5JNwPgiMso?list=PLkk92zzyru5OAtc_ItUubaSSq6S_TGfRn>`__.
