Repository: sjentsch/jamoviDocs
Catalog: _locale/*/LC_MESSAGES/getting-started/um_1_installation.po
Languages: de, nb

source: Installation
nb: Installasjon

source: jamovi is available for Windows Vista (64-bit) and above. Installation on windows is quite straight-forward, and should be familiar to anyone who has installed software on Windows before. Download the latest version from the `download page <https://www.jamovi.org/download.html>`__, and double-click the icon.
de: jamovi ist für Windows Vista (64-Bit) und neuere Windows-Versionen verfügbar. Die Installation unter Windows ist einfach: Laden Sie die gewünschte Version (.exe) von der `Download-Seite <https://www.jamovi.org/download.html>`__ herunter und doppelklicken Sie auf das Symbol der heruntergeladenen Datei.
nb: jamovi er tilgjengelig for Windows Vista (64-bit) og nyere versjoner. Installasjon på Windows er ganske enkelt, og bør være kjent til alle som har installert programvare på Windows før. Last ned den nyeste versjonen fra jamovi sin `download page <https://www.jamovi.org/download.html>`__, og dobbeltklikk på ikonet til nedlastingen.

source: At some institutions (particularly universities), the “normal” approach to installing software is blocked by IT security policies. In this case, you can download our .zip version. To use this, simply download, unzip to a location on the computer, and naviagate to the bin folder. Double-clicking jamovi.exe will begin jamovi. It’s possible that additional security restrictions prevent jamovi from working in this way, in which case it would be worth raising the issue with your IT staff.
de: In einigen Institutionen (insbesondere Universitäten) wird der „normale“ Ansatz zur Installation von Software (.exe) durch IT-Sicherheitsrichtlinien blockiert. In diesem Fall können Sie die ZIP-Version herunterladen. Um diese zu verwenden, laden Sie es einfach herunter, entpacken Sie die Datei in einen Ordner auf dem Computer und navigieren Sie in diesem Ordner zum Unterverzeichnis ``bin``. Durch Doppelklicken auf jamovi.exe wird jamovi gestartet. Es ist möglich, dass zusätzliche Sicherheitsbeschränkungen verhindern, dass Jamovi auf diese Weise funktioniert. In diesem Fall müssen Sie das Problem bei Ihren IT-Mitarbeitern ansprechen und gemeinsam nach einer Lösung suchen.
nb: På noen institusjoner (f.eks. universiteter) er den "normale" tilnærmingen til å installere programvare blokkert pga. IT-sikkerhetstiltak. I dette tilfellet kan du laste ned .zip-versjonen vår. For å bruke dette, bare last ned, pakke ut på et sted på datamaskinen og naviger til bin-mappe innenfor dette arkivet. Dobbeltklikk på jamovi.exe for å starte jamovi. Det er mulig at ytterligere sikkerhetsbegrensninger forhindrer å starte jamovi også på denne måten. I dette tilfelle er det best å snakke om dette problemet og mulige løsninger med IT-personalet.

source: jamovi is available for macOS 10.9+ (Mavericks and newer). To install it, download the .dmg file from our `download page <https://www.jamovi.org/download.html>`__, and double-click the downloaded file. This will present you with a “file view”, and you can install jamovi by “dragging-and-dropping” the jamovi application to the Applications folder (in the usual way). After this, jamovi will appear in your applications, and can be started like any other installed application.
de: jamovi ist für macOS 10.9+ (Mavericks und neuer) verfügbar. Laden Sie zur Installation die .dmg-Datei von unserer `Download-Seite <https://www.jamovi.org/download.html>`__ herunter und doppelklicken Sie auf die heruntergeladene Datei. Dadurch wird eine „Dateiansicht“ angezeigt, und Sie können jamovi installieren, indem Sie die jamovi-Anwendung (wie üblich) in den Anwendungsordner ziehen und dort ablegen. Danach wird jamovi in Ihren Anwendungen angezeigt und kann wie jede andere installierte Anwendung gestartet werden.
nb: jamovi er tilgjengelig for macOS 10.9+ (Mavericks) og nyere versjoner. For å installere den, last ned .dmg-filen fra jamovi sin `download page <https://www.jamovi.org/download.html>`__, og dobbeltklikk på den nedlastede filen. Dette vil gi deg en "filvisning", og du kan installere jamovi ved å "dra og slippe" jamovi-applikasjonen til Applications-mappen (på vanlig måte). Etter dette vil jamovi vises i applikasjonene dine, og kan startes som alle andre installerte applikasjoner.

source: jamovi for macOS has an auto-update mechanism, and can alert you to when new versions are available. You can update your version of jamovi from the app menu (☰; at the top right of the window).
de: jamovi für macOS verfügt über einen automatischen Aktualisierungsmechanismus und benachrichtigt Sie, wenn neue Versionen verfügbar sind. Sie können dann Ihre jamovi-Version über das App-Menü (☰; oben rechts im Fenster) aktualisieren.
nb: jamovi for macOS har en automatisk oppdateringsmekanisme, og kan varsle deg om når nye versjoner er tilgjengelige. Du kan oppdatere din versjon av fra app-menyen innenfor jamovi (☰; øverst til høyre i vinduet).

source: Linux and Chromebooks
de: Linux und Chromebooks
nb: Linux og Chromebooks

source: jamovi is currently available for Linux, (for all ‘flatpak participating linux distributions’ – which is most of them), and Chromebooks, from flathub.
de: jamovi ist für alle Linux-Distributionen, die Flatpak-Installationen erlauben – das ist die überwiegende Mehrzahl – und Chromebooks via flathub.org erhältlich.
nb: jamovi er tilgjengelig for alle Linux-distribusjoner som tilbyr Flatpak (som er de aller fleste), og Chromebooks, via flathub.org.

source: **Note**: Some Chromebooks experience a blank screen issue when starting up jamovi. If you encounter this, there are instructions on how to fix this a little :ref:`further down<blank-screen-on-chromebooks>`.
de: **Hinweis**: Bei einigen Chromebooks startet jamovi mit einem leeren Bildschirm. Wenn Sie auf dieses Problem stoßen, finden Sie Anweisungen, wie Sie dies beheben können :ref:`weiter unten<blank-screen-on-chromebooks>`.
nb: **Pass på**: Noen Chromebook-maskiner opplever et problem at bare et blankt skjerm viser når du starter opp jamovi. Hvis du støter på dette, er det instruksjoner om hvordan du fikser dette litt :ref:`lenger ned under <blank-screen-on-chromebooks>`.

source: If you’re new to flatpak/flathub, you’ll need to follow the setup guide on `our flathub page <https://flathub.org/apps/details/org.jamovi.jamovi>`__.
de: Wenn Sie wenig vertraut mit Flatpaks sind, folgen Sie bitte der Installationsanleitung auf `unserer Flathub-Seite <https://flathub.org/apps/details/org.jamovi.jamovi>`__.
nb: Hvis du er ny til flatpak / flathub, kan du følge installasjonsveiledningen på `vår flathub-side <https://flathub.org/apps/details/org.jamovi.jamovi>`__.

source: If you’re an old hand at flatpak, you can install jamovi with the command:
de: Wenn Sie Erfahrung mit flatpak haben, können Sie jamovi einfach mit dem folgenden Befehl installieren:
nb: Hvis du har erfaring med flatpak, kan du installere jamovi med kommandoen:

source: and later, you can update your version of jamovi with:
de: und mit dem folgenden Befehl können Sie Ihre jamovi-Version später aktualisieren:
nb: og senere kan du oppdatere din versjon av jamovi med:

source: Text not appearing in plots under linux
de: Merkwürdige Sonderzeichen in den Abbildungen unter Linux
nb: Tekst vises ikke i figurer under Linux

source: On some linux machines, the flatpak font cache is not up-to-date, resulting in plots in jamovi not displaying text correctly. To remedy this, you can run the following command at the terminal:
de: Auf einigen Linux-Computern wird der Schriftarten-Cache unter Flatpak nicht wie vorgesehen aktualisiert, was dazu führt, dass in Abbildungen in jamovi der Text der Beschriftungen nicht korrekt angezeigt wird. Um dies zu beheben, können Sie den folgenden Befehl im Terminal ausführen:
nb: På noen Linux-maskiner er ikke flatpak font-cache oppdatert, noe som resulterer i at tekst i figurer (f.eks. beskriftning på aksene) i jamovi ikke viser tekst riktig. For å hjelpe ved dette, kan du kjøre følgende kommando i terminalen:

source: This appears to be an issue with flatpaks, and we’re working with the flatpak community to get to the bottom of it.
de: Dies scheint ein Problem mit Flatpaks zu sein, und wir arbeiten mit der Flatpak-Community zusammen, um eine dauerhafte Lösung für das Problem zu finden.
nb: Dette ser ut til å være et generelt problem med flatpak, og vi jobber med flatpak-community for å finne en løsning for dette problemet.

source: Blank screen at startup on Chromebooks
de: Leerer Bildschirm beim Start von jamovi auf Chromebooks
nb: Blank skjerm ved oppstart på Chromebook

source: Some Chromebooks experience a blank screen when starting up jamovi. The cause of this issue is not completely clear at this time, however it can be fixed by disabling “Crostini GPU support”.
de: Auf einigen Chromebooks wird beim Starten von jamovi ein leerer Bildschirm angezeigt. Die Ursache dieses Problems ist derzeit noch nicht vollständig geklärt. Sie lässt sich jedoch durch Deaktivieren der „Crostini-GPU-Unterstützung“ beheben.
nb: Noen Chromebook-maskiner viser en blank skjerm når du starter opp jamovi. Årsaken til dette problemet er ikke helt klar på nåværende tidspunktet, men det kan løses ved å deaktivere “Crostini GPU-støtte”.

source: Enter ``chrome://flags/`` into the ChromeOS address bar. This will bring up “Experiments”. Search for ``Crostini GPU Support`` and set it to disabled. After restarting your Chromebook the issue will be fixed (special thanks to `@mulderc <https://github.com/mulderc>`__).
de: Geben Sie ``chrome://flags/`` in der ChromeOS-Adressleiste ein. Dies öffnet \"Experimentelle Einstellungen\". Suchen Sie nach ``Crostini GPU Support`` und deaktivieren Sie die Einstellung. Nach dem Neustart Ihres Chromebooks ist das Problem behoben (Danke an `@mulderc <https://github.com/mulderc>`__" für den Hinweis).
nb: Skriv inn ``chrome://flags/`` i ChromeOS-adressefeltet. Dette vil få frem en side som kalles "Experiments". Søk etter ``Crostini GPU Support`` og sett den til deaktivert. Etter at du har startet Chromebook på nytt, er problemet løst (takk til `@mulderc <https://github.com/mulderc>`__ for veiledning).
